# SELECT basics

In [1]:
library(tidyverse)
library(DBI)
library(getPass)
drv <- switch(Sys.info()['sysname'],
             Windows="PostgreSQL Unicode(x64)",
             Darwin="/usr/local/lib/psqlodbcw.so",
             Linux="PostgreSQL")
con <- dbConnect(
  odbc::odbc(),
  driver = drv,
  Server = "localhost",
  Database = "sqlzoo",
  UID = "postgres",
  PWD = getPass("Password?"),
  Port = 5432
)
options(repr.matrix.max.rows=20)

-- Attaching packages --------------------------------------- tidyverse 1.3.0 --

v ggplot2 3.3.0     v purrr   0.3.3
v tibble  3.0.0     v dplyr   0.8.5
v tidyr   1.0.2     v stringr 1.4.0
v readr   1.3.1     v forcats 0.5.0

-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

Password? ·········

## 1. Introducing the `world` table of countries

The example uses a WHERE clause to show the population of 'France'. Note that strings (pieces of text that are data) should be in 'single quotes';

**Modify it to show the population of Germany**

In [2]:
world <- dbReadTable(con, 'world')
world %>% filter(name=='Germany') %>% select(population)

  population
1 80716000

## 2. Scandinavia

Checking a list The word **IN** allows us to check if an item is in a list. The example shows the name and population for the countries 'Brazil', 'Russia', 'India' and 'China'.

**Show the name and the population for 'Sweden', 'Norway' and 'Denmark'.**

In [3]:
world %>% 
    filter(name %in% c('Sweden', 'Norway', 'Denmark')) %>%
    select(name, population)

  name    population
1 Denmark 5634437
2 Norway  5124383
3 Sweden  9675885

## 3. Just the right size

Which countries are not too small and not too big? `BETWEEN` allows range checking (range specified is inclusive of boundary values). The example below shows countries with an area of 250,000-300,000 sq. km. Modify it to show the country and the area for countries with an area between 200,000 and 250,000.

In [4]:
world %>% 
    filter(between(area, 200000, 250000)) %>% 
    select(name, area)

  name           area
1 Belarus        207600
2 Ghana          238533
3 Guinea         245857
4 Guyana         214969
5 Laos           236800
6 Romania        238391
7 Uganda         241550
8 United Kingdom 242900

In [5]:
dbDisconnect(con)